---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DummyHostMustBePerpendicularToXY
source: html/ee1c9eff-0af1-2b33-2cb1-3309dad61d3b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DummyHostMustBePerpendicularToXY Property

Dummy host must be perpendicular to Z or Y axis.

## Syntax (C#)
```csharp
public static FailureDefinitionId DummyHostMustBePerpendicularToXY { get; }
```